# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [2]:
# import libraries here
import pandas as pd
import numpy as np

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [3]:
# your code here
temp= pd.read_csv ('Temp_States.csv')

#### Print `temp`.

In [18]:
temp
# your code here

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [10]:
# your code here
temp_data_types=temp.dtypes
print(temp_data_types)

City            object
State           object
Temperature    float64
dtype: object

In [ ]:
"""
We have 2 types of data, object and float.
"""

#### Select the rows where state is New York.

In [16]:
# your code here
new_york_rows= temp[temp['State'] == 'New York']
print(new_york_rows)

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [32]:
# your code here
mean_temp_NY=new_york_rows['Temperature'].mean()
print ('The average temperature of cities in NY is:',round(mean_temp_NY, 2))

The average temperatura of cities in NY is: 10.74

#### Which states and cities have a temperature above 15 degrees Celsius?

In [34]:
# your code here
high_temp= temp[temp['Temperature'] >15]
print(high_temp)

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
5    Treton   New Jersey    22.222222
6    Newark   New Jersey    20.000000

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [35]:
# your code here
cities_high_temp= high_temp['City']
cities_high_temp

0         NYC
3    Hartford
5      Treton
6      Newark
Name: City, dtype: object

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [48]:
target_temp = temp[(temp['Temperature'] > 15) & (temp['Temperature'] < 20)]
cities_target_temp = target_temp['City']
print('The cities where temperature is higher than 15 and lower than 20 are:')
cities_target_temp

The cities where temperature is higher than 15 and lower than 20 are:

0         NYC
3    Hartford
Name: City, dtype: object

#### Find the mean and standard deviation of the temperature of each state.

In [64]:
state_stats = temp.groupby('State')['Temperature'].agg(['mean', 'std'])

# Display the result
state_stats.round(2)

              mean   std
State
Connecticut  15.83  1.96
New Jersey   21.11  1.57
New York     10.74  8.13

# [ONLY ONE MANDATORY]  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [3]:
# your code here
employees= pd.read_csv('Employee.csv')

#### Explore the data types of the `employees` dataframe. Comment your results.

In [4]:
employees

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

In [93]:
# your code here
employees.describe()

          Years     Salary
count  9.000000   9.000000
mean   4.111111  48.888889
std    2.803767  16.541194
min    1.000000  30.000000
25%    2.000000  35.000000
50%    3.000000  55.000000
75%    7.000000  60.000000
max    8.000000  70.000000

In [82]:
"""
The highest salary is 70 and the lowest is 30, the salary's median is 55.
The maximum years in the company is 9 and the minimum is 1 and the median is 3 and the mean 4.
"""

"\nThe highest salary is 70 and the lowest is 30, the salary's median is 55.\nThe maximum years in the company is 9 and the minimum is 1 and the median is 3 and the mean 4.\n"

#### What's the average salary in this company?

In [94]:
# your code here
avg_salary= employees['Salary'].mean()
print("The company's average salary is:", round(avg_salary, 0))

The company's average salary is: 49.0

#### What's the highest salary?

In [96]:
# your code here
max_salary = employees['Salary'].max()
print("The company's max salary is:", round(max_salary, 0))

The company's max salary is: 70

#### What's the lowest salary?

In [98]:
# your code here
# your code here
min_salary = employees['Salary'].min()
print("The company's min salary is:", round(min_salary, 0))

The company's min salary is: 30

#### Who are the employees with the lowest salary?

In [107]:
# your code here
lowest_salary= employees[employees['Salary']== 30]
employees_name = lowest_salary['Name']
print ('The employees with the lowest salary are:')
employees_name

The employees with the lowest salary are:

1    Maria
2    David
Name: Name, dtype: object

#### Find all the information about an employee called David.

In [114]:
# your code here
david_info =employees[employees['Name']== 'David']
david_info

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

#### Could you return only David's salary?

In [112]:
# your code here
david_salary= david_info['Salary']
print ("The David's salary is:")
david_salary

The David's salary is:

2    30
Name: Salary, dtype: int64

#### Print all the rows where job title is associate.

In [115]:
# your code here
employees[employees['Title']== 'associate']

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [116]:
# Method 1
# your code here
employees.head(3)

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [117]:
# Method 2
# your code here
employees[:3]

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find the employees whose title is associate and whose salary is above 55.

In [121]:
# your code here
target_employees= employees[(employees['Title']=='associate') & (employees['Salary']>55)]
target_employees

    Name Department Education Gender      Title  Years  Salary
7  Pedro         IT       Phd      M  associate      7      60

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [6]:
# your code here
employees_group = employees.groupby('Years')['Salary'].agg(['mean'])
employees_group.round (0)

       mean
Years
1      35.0
2      38.0
3      55.0
4      35.0
7      60.0
8      70.0

####  What is the average salary per title?

In [8]:
# your code here
salary_per_title = employees.groupby('Title')['Salary'].agg(['mean'])
salary_per_title.round (0)

           mean
Title
VP         70.0
analyst    32.0
associate  57.0

####  Find the salary quartiles.

In [12]:
# your code here
salary_quartiles = employees ['Salary']
Q1 = salary_quartiles.quantile(0.25)
Q2 =salary_quartiles.quantile(0.5)
Q3 =salary_quartiles.quantile(0.75)

print ('Salary Q1 is:', Q1)
print ('Salary Q2 is:', Q2)
print ('Salary Q3 is:', Q3)

Salary Q1 is: 35.0
Salary Q2 is: 55.0
Salary Q3 is: 60.0

#### Is the mean salary different per gender?

In [20]:
# your code here
gender_mean_salary = employees.groupby('Gender')['Salary'].agg(['mean'])
gender_mean_salary
print ('Yes, it is. The mean salary is different per gender, being higher for men.')

Mean salary per gender:
        mean
Gender
F       47.5
M       50.0

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [41]:
department_employees = employees.groupby('Department').agg({'Salary': ['mean', 'max', 'min'], 'Years':['mean', 'max', 'min']})
department_employees

           Salary             Years
             mean max min      mean max min
Department
HR          45.00  70  30  4.666667   8   2
IT          48.75  70  30  4.500000   8   1
Sales       55.00  55  55  2.500000   3   2

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [42]:
# your code here

department_employees ['Salary_Difference'] = employees.groupby('Department').agg({
    'Salary': lambda x: x.max() - x.min()})

department_employees

           Salary             Years         Salary_Difference
             mean max min      mean max min
Department
HR          45.00  70  30  4.666667   8   2                40
IT          48.75  70  30  4.500000   8   1                40
Sales       55.00  55  55  2.500000   3   2                 0

# [ONLY ONE MANDATORY] Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [ ]:
# your code here

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [ ]:
# your code here

In [ ]:
"""
your comments here
"""

####  What is the average purchase price?

In [ ]:
# your code here

#### What are the highest and lowest purchase prices?

In [ ]:
# your code here

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [ ]:
# your code here

#### How many customers do we have in Spain?

In [ ]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [ ]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [ ]:
# your code here

#### Select all free orders.

In [ ]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [ ]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [ ]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [ ]:
# your code here

#### Select all orders made in the month of August.

In [ ]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [ ]:
# your code here

#### What's the  average amount of money spent by country?

In [ ]:
# your code here

#### What's the most expensive item?

In [ ]:
# your code here

#### What is the average amount spent per year?

In [ ]:
# your code here